Tekla Open API Reference for Tekla Structures 2025
BoltArray.GetBoltDistXCount Method
 Returns the amount of X distances in the bolt array.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int GetBoltDistXCount()
Public Function GetBoltDistXCount As Integer
Return Value
Type: Int32
The amount of X distances.
See Also
Reference
BoltArray Class
Tekla.Structures.Model Namespace